# EnergyAnalysisGlazingIsShaded Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EnergyAnalysisGlazingIsShaded Property
ParameterTypeId Class See Also
---
"Glazing is Shaded"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EnergyAnalysisGlazingIsShaded { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnergyAnalysisGlazingIsShaded As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EnergyAnalysisGlazingIsShaded {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace